&НаКлиенте
Перем Компонента;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ури = "ws://localhost:8080/ws";
КонецПроцедуры

&НаКлиенте
Процедура Коннект(Команда)
	
	Компонента = новый COMОбъект("bslRabbit.BslWSocket");
	рез = Компонента.UseWebSockets(ури);
	
КонецПроцедуры

&НаКлиенте
Процедура ОТправитьКоманду(Команда)
	ОчиститьСообщения();
	рез = Компонента.SendCommand("из 1с "+ТекущаяДата());
	Сообщить("Сенд "+рез);
	рез2 = Компонента.ReadMessage();
	Сообщить("Ответ "+рез2);
	
КонецПроцедуры
